Repository: Warhammer2000/Course_Project_Git
Catalog: Resources/Views/Admin/Index.*.resx
Languages: ru_ru

source: Admin - Manage Users
ru_ru: Администратор - Управление пользователями

source: Manage Users
ru_ru: Управление пользователями

source: UserName
ru_ru: Имя пользователя

source: Email
ru_ru: Электронная почта

source: Locked Out
ru_ru: Заблокирован для входа

source: Blocked
ru_ru: Ограничен в действиях

source: Admin
ru_ru: Администратор

source: Actions
ru_ru: Действия

source: Lock
ru_ru: Заблокировать пользователя

source: Unlock
ru_ru: Разблокировать пользователя

source: Block
ru_ru: Ограничить пользователя

source: Unblock
ru_ru: Снять ограничения с пользователя

source: Delete
ru_ru: Удалить

source: Add Admin
ru_ru: Добавить администратора

source: Remove Admin
ru_ru: Удалить администратора

source: The user's username
ru_ru: Имя пользователя

source: The user's email address
ru_ru: Электронная почта пользователя

source: This function prevents the user from logging in at all
ru_ru: Эта функция полностью предотвращает вход пользователя в систему

source: This function restricts the user from creating, editing, and deleting collections and items, as well as deleting comments
ru_ru: Эта функция запрещает пользователю создавать, редактировать и удалять коллекции и элементы, а также удалять комментарии

source: This function allows the user to create, edit, and delete all collections and items, as well as delete, block, and assign other administrators
ru_ru: Эта функция позволяет пользователю создавать, редактировать и удалять все коллекции и элементы, а также удалять, блокировать и назначать других администраторов

source: Available actions for this user
ru_ru: Доступные действия для этого пользователя

source: SuccessMessage
ru_ru: Успешное сообщение

source: WarningMessage
ru_ru: Предупреждение

source: CheckCircle
ru_ru: fas fa-check-circle

source: ExclamationCircle
ru_ru: fas fa-exclamation-circle

source: User has been deleted.
ru_ru: Пользователь был удален.

source: User not found.
ru_ru: Пользователь не найден.

source: User {0} has been blocked.
ru_ru: Пользователь {0} был заблокирован.

source: User {0} has been locked.
ru_ru: Пользователь {0} был заблокирован.

source: User {0} has been unblocked.
ru_ru: Пользователь {0} был разблокирован.

source: User {0} has been unlocked.
ru_ru: Пользователь {0} был разблокирован.

source: User has been added to Admins.
ru_ru: Пользователь был добавлен к администраторам.

source: User not found or already an Admin.
ru_ru: Пользователь не найден или уже является администратором.

source: User has been removed from Admins.
ru_ru: Пользователь был удален из администраторов.
